src/DataProcessors/РаспределениеПоставокПоЭДО/РаспределениеПоставокПоЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаспределениеПоставокПоЭДО</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокВходящий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокВходящий</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГТД</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПоставщика</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределённыеМПЗ</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПоставщику</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоступлениеМПЗ</name>
      <type>
        <types>DocumentRef.ПоступлениеМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/AccumulationRegisters/ЗаказыПоставщикам/ЗаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПоставщикам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ПоступлениеМПЗ/ПоступлениеМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеМПЗ</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.Реализация</basedOn>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>InformationRegister.Цены</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Реализация</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокВходящий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокВходящий</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <comment>Текущий курс</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>НЦ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаВалюта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВалюта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоВалюта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГТД</name>
      <comment>Номер грузовой таможенной декларации</comment>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <basedOn>Document.ЗаявкаНаЗакупку</basedOn>
  <basedOn>Document.ЗаявкаОтПокупателя</basedOn>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <registerRecords>AccumulationRegister.ДоговорыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ЗаявкиНаЗакупку</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.ЗаявкаНаЗакупку</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <comment>Текущий курс</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дополнение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗНП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>НЦ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаВалюта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НомераБФ</name>
    <attributes>
      <name>НомерДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оплачен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БарКоды</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>БарКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСоздания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/НомераГТД/НомераГТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НомераГТД</name>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВнесения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/РаспределениеПоставокПоЭДО/Forms/Форма/Module.bsl
&НаСервере
Процедура СозданиеТаблицыНезакрытыхЗаказовПоставщику()
Запрос = Новый Запрос;
СписокМПЗ = Новый СписокЗначений;

	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
	СписокМПЗ.Добавить(ТЧ.МПЗ);
	КонецЦикла;
ТаблицаЗаказов.Очистить(); 
Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику,
	|	ЗаказыПоставщикамОстатки.МПЗ,
	|	ЗаказыПоставщикамОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки КАК ЗаказыПоставщикамОстатки
	|ГДЕ
	|	ЗаказыПоставщикамОстатки.Контрагент = &Контрагент
	|	И ЗаказыПоставщикамОстатки.МПЗ В(&СписокМПЗ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Дата";
Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
Запрос.УстановитьПараметр("СписокМПЗ", СписокМПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ = ТаблицаЗаказов.Добавить();
	ТЧ.ЗаказПоставщику = ВыборкаДетальныеЗаписи.ЗаказПоставщику;
	ТЧ.МПЗ = ВыборкаДетальныеЗаписи.МПЗ;
	ТЧ.Остаток = ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЦикла;
КонецПроцедуры

&НаСервере            
Функция ПолучитьСоздатьГТД(Страна,ГТД)
НомерГТД = Справочники.НомераГТД.НайтиПоНаименованию(СокрЛП(ГТД));
	Если НомерГТД.Пустая() Тогда
	НомерГТД = Справочники.НомераГТД.СоздатьЭлемент();
	НомерГТД.Наименование = ГТД;
	НомерГТД.Страна = Страна;
	НомерГТД.ДатаВнесения = ТекущаяДата();
	НомерГТД.Записать();
	Возврат(НомерГТД.Ссылка);
	Иначе
	Возврат(НомерГТД);
	КонецЕсли; 	
КонецФункции

&НаСервере
Процедура РаспределитьНаСервере()
Объект.РаспределённыеМПЗ.Очистить();
	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
		Если ТЧ.Остаток <= 0 Тогда
		Продолжить;
		КонецЕсли; 
	ВыборкаЗаказов = ТаблицаЗаказов.НайтиСтроки(Новый Структура("МПЗ",ТЧ.МПЗ));
		Если ВыборкаЗаказов.Количество() > 0 Тогда
			Для к = 0 по ВыборкаЗаказов.Количество()-1 Цикл
			Заказ = ВыборкаЗаказов[к];	
				Если Заказ.Остаток >= ТЧ.Остаток Тогда
				Заказ.Остаток = Заказ.Остаток - ТЧ.Остаток;
				ТЧ_МПЗ = Объект.РаспределённыеМПЗ.Добавить();
				ТЧ_МПЗ.МПЗ = ТЧ.МПЗ;
				ТЧ_МПЗ.Количество = ТЧ.Остаток;
				ТЧ_МПЗ.Цена = ТЧ.Цена;
				ТЧ_МПЗ.ЗаказПоставщику = Заказ.ЗаказПоставщику;
				ТЧ_МПЗ.ГТД = ПолучитьСоздатьГТД(Справочники.СтраныМира.НайтиПоНаименованию(ТЧ.Страна,Истина),ТЧ.ГТД);
				ТЧ.Остаток = 0;
				Прервать;
				ИначеЕсли Заказ.Остаток > 0 Тогда
				КолВЗаказе = Заказ.Остаток;
				ТЧ.Остаток = ТЧ.Остаток - КолВЗаказе;			
				Заказ.Остаток = 0;
				ТЧ_МПЗ = Объект.РаспределённыеМПЗ.Добавить();
				ТЧ_МПЗ.МПЗ = ТЧ.МПЗ;
				ТЧ_МПЗ.Количество = КолВЗаказе;
				ТЧ_МПЗ.Цена = ТЧ.Цена;
				ТЧ_МПЗ.ЗаказПоставщику = Заказ.ЗаказПоставщику;
				ТЧ_МПЗ.ГТД = ПолучитьСоздатьГТД(Справочники.СтраныМира.НайтиПоНаименованию(ТЧ.Страна,Истина),ТЧ.ГТД);
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли; 
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	Состояние("Обработка...",,"Создание таблицы незакрытых заказов поставщику...");
	СозданиеТаблицыНезакрытыхЗаказовПоставщику();
	Состояние("Обработка...",,"Распределение МПЗ по заказам поставщикам...");	
	РаспределитьНаСервере();
		Если Элементы.ТабличнаяЧасть.ТекущаяСтрока <> Неопределено Тогда
		Элементы.РаспределённыеМПЗ.ОтборСтрок = Новый ФиксированнаяСтруктура("МПЗ", Элементы.ТабличнаяЧасть.ТекущиеДанные.МПЗ);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущаяСтрока <> Неопределено Тогда
	Элементы.РаспределённыеМПЗ.ОтборСтрок = Новый ФиксированнаяСтруктура("МПЗ", Элемент.ТекущиеДанные.МПЗ); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьРаспределённыеМПЗ(МПЗ)
МассивСтрок = Объект.РаспределённыеМПЗ.НайтиСтроки(Новый Структура("МПЗ",МПЗ)); 
	Для каждого Стр Из МассивСтрок Цикл 
	Объект.РаспределённыеМПЗ.Удалить(Стр); 
	КонецЦикла;  
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьПередУдалением(Элемент, Отказ)
УдалитьРаспределённыеМПЗ(Элемент.ТекущиеДанные.МПЗ);
КонецПроцедуры

&НаСервере
Функция СоздатьДокумент(ЗаказПоставщику,ТЗ)
	Попытка
	Поступление = Документы.ПоступлениеМПЗ.СоздатьДокумент();
	Поступление.Дата = ТекущаяДата();
	Поступление.Автор = ПараметрыСеанса.Пользователь;
	Поступление.ДокументОснование = ЗаказПоставщику;	
	Поступление.Подразделение = Объект.МестоХранения.Подразделение;
	Поступление.УстановитьНовыйНомер(ПрисвоитьПрефикс(Объект.МестоХранения.Подразделение));
	Поступление.МестоХранения = Объект.МестоХранения;
	Поступление.Контрагент = ЗаказПоставщику.Контрагент;
	Поступление.Договор = ЗаказПоставщику.Договор;
	Поступление.Курс = ЗаказПоставщику.Курс;
	Поступление.НомерДокВходящий = СокрЛП(Объект.НомерДокВходящий); 
	Поступление.ДатаДокВходящий = СокрЛП(Объект.ДатаДокВходящий);
		Если Значениезаполнено(Объект.НомерДокВходящий) Тогда
		Поступление.Комментарий = "Создан на основании ЭД № " + СокрЛП(Объект.НомерДокВходящий) + " от "+Объект.ДатаДокВходящий;
		КонецЕсли; 
			Для каждого ТЧ Из ТЗ Цикл
			ТЧПП = Поступление.ТабличнаяЧасть.Добавить();
			ТЧПП.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
			ТЧПП.МПЗ = ТЧ.МПЗ;	
			ТЧПП.ЕдиницаИзмерения = ПолучитьОсновнуюЕдиницуИзмеренияПоБазовой(ТЧ.МПЗ);
			ТЧПП.НЦ = ТЧ.НЦ;
			ТЧПП.Количество = ТЧ.Количество;
			ТЧПП.Цена = ТЧ.Цена;
			ТЧПП.Сумма = ТЧ.Цена*ТЧ.Количество;
				Если Не ЗаказПоставщику.Договор.БезНДС Тогда
				ТЧПП.СтавкаНДС = Константы.ОсновнаяСтавкаНДС.Получить();
				ТЧПП.НДС = ТЧПП.Сумма*ТЧПП.СтавкаНДС.Ставка/100;
				ТЧПП.Всего = ТЧПП.Сумма + ТЧПП.НДС;				
				Иначе
				ТЧПП.Всего = ТЧПП.Сумма; 	
				КонецЕсли;
			ТЧПП.ГТД = ТЧ.ГТД;
			КонецЦикла;	
    Поступление.Записать(РежимЗаписиДокумента.Запись);
	Возврат(Поступление.Ссылка);
	Исключение
	Сообщить(ОписаниеОшибки());
	Возврат(Неопределено);
	КонецПопытки;
КонецФункции
                           
&НаСервере
Функция ПолучитьНЦ(ЗаказПоставщику,МПЗ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщикуТабличнаяЧасть.МПЗ КАК МПЗ,
	|	ЗаказПоставщикуТабличнаяЧасть.НЦ КАК НЦ
	|ИЗ
	|	Документ.ЗаказПоставщику.ТабличнаяЧасть КАК ЗаказПоставщикуТабличнаяЧасть
	|ГДЕ
	|	ЗаказПоставщикуТабличнаяЧасть.Ссылка = &Ссылка
	|	И ЗаказПоставщикуТабличнаяЧасть.МПЗ = &МПЗ";
Запрос.УстановитьПараметр("МПЗ", МПЗ);
Запрос.УстановитьПараметр("Ссылка", ЗаказПоставщику);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.НЦ);
	КонецЦикла;
Возврат(Ложь);
КонецФункции

&НаСервере
Процедура СоздатьДокументыНаСервере()
ТЗ = Новый ТаблицаЗначений;

ТЗ.Колонки.Добавить("Идентификатор");
ТЗ.Колонки.Добавить("МПЗ");
ТЗ.Колонки.Добавить("Количество");
ТЗ.Колонки.Добавить("Цена");
ТЗ.Колонки.Добавить("ГТД");
ТЗ.Колонки.Добавить("НЦ");

Объект.РаспределённыеМПЗ.Сортировать("ЗаказПоставщику,МПЗ");
ТекЗаказ = Неопределено;
	Для каждого ТЧ Из Объект.РаспределённыеМПЗ Цикл	
		Если ТекЗаказ <> ТЧ.ЗаказПоставщику Тогда
			Если ТекЗаказ <> Неопределено Тогда
			Результат = СоздатьДокумент(ТекЗаказ,ТЗ);
				Если Результат <> Неопределено Тогда
					Для Каждого ТЧ_ТЗ Из ТЗ Цикл	
					Стр = Объект.РаспределённыеМПЗ.НайтиПоИдентификатору(ТЧ_ТЗ.Идентификатор);
					Стр.ПоступлениеМПЗ = Результат;
					КонецЦикла; 			
				КонецЕсли;
			ТЗ.Очистить();
			КонецЕсли;
		ТекЗаказ = ТЧ.ЗаказПоставщику;
		КонецЕсли; 
	ТЧ_МПЗ = ТЗ.Добавить();
	ТЧ_МПЗ.Идентификатор = ТЧ.ПолучитьИдентификатор();
	ТЧ_МПЗ.МПЗ = ТЧ.МПЗ;
	ТЧ_МПЗ.Количество = ТЧ.Количество;
	ТЧ_МПЗ.Цена = ТЧ.Цена;
	ТЧ_МПЗ.ГТД = ТЧ.ГТД;
	ТЧ_МПЗ.НЦ = ПолучитьНЦ(ТЧ.ЗаказПоставщику,ТЧ.МПЗ);
	КонецЦикла;
		Если ТекЗаказ <> Неопределено Тогда	
		Результат = СоздатьДокумент(ТекЗаказ,ТЗ);
			Если Результат <> Неопределено Тогда
				Для Каждого ТЧ_ТЗ Из ТЗ Цикл	
				Стр = Объект.РаспределённыеМПЗ.НайтиПоИдентификатору(ТЧ_ТЗ.Идентификатор);
				Стр.ПоступлениеМПЗ = Результат;
				КонецЦикла;			
			КонецЕсли;
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда) 
СоздатьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоМПЗ(МПЗ)
КоличествоИтого = 0;
	Для каждого ТЧ Из Объект.РаспределённыеМПЗ Цикл
		Если ТЧ.МПЗ = МПЗ Тогда	
		КоличествоИтого = КоличествоИтого + ТЧ.Количество;
		КонецЕсли; 
	КонецЦикла;
Возврат(КоличествоИтого);
КонецФункции

&НаСервере
Функция ПечатьНаСервере()
ТабДок = Новый ТабличныйДокумент;

ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");
ОблДокумент = Макет.ПолучитьОбласть("Документ");
ОблКонец = Макет.ПолучитьОбласть("Конец");
ТабДок.Вывести(ОблШапка);
	Для каждого ТЧ_МПЗ Из Объект.ТабличнаяЧасть Цикл
	ОблМПЗ.Параметры.МПЗ = ТЧ_МПЗ.МПЗ;
	ОблМПЗ.Параметры.Количество = ПолучитьКоличествоМПЗ(ТЧ_МПЗ.МПЗ);
	ТабДок.Вывести(ОблМПЗ);
		Для каждого ТЧ Из Объект.РаспределённыеМПЗ Цикл
			Если ТЧ_МПЗ.МПЗ = ТЧ.МПЗ Тогда	
			ОблДокумент.Параметры.ЗаказПоставщику = ТЧ.ЗаказПоставщику;
			ОблДокумент.Параметры.Количество = ТЧ.Количество;
			ОблДокумент.Параметры.ПоступлениеМПЗПрочее = ТЧ.ПоступлениеМПЗПрочее;
			ТабДок.Вывести(ОблДокумент); 
			КонецЕсли; 
		КонецЦикла;
	КонецЦикла;
ОблКонец.Параметры.Количество = Объект.РаспределённыеМПЗ.Итог("Количество");
ТабДок.Вывести(ОблКонец);
Возврат(ТабДок);
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
ТД = ПечатьНаСервере();
ТД.Показать("Распределение поставок по заказам поставщикам");
КонецПроцедуры

&НаСервере
Процедура ПолучитьДокументЭДОНаСервере()
Объект.ТабличнаяЧасть.Очистить();
БазаБух = ОбщийМодульСинхронизации.УстановитьCOMСоединение(БазаДанных);
	Если БазаБух = Неопределено Тогда
	Сообщить("Не открыто соединение с бух. базой!");
	КонецЕсли;
Запрос = БазаБух.NewObject("Запрос");

Запрос.Текст = 
	"ВЫБРАТЬ
	|	СообщениеЭДО.Ссылка КАК Ссылка,
	|	СообщениеЭДО.ЭлектронныйДокумент.Номер КАК ЭлектронныйДокументНомер,
	|	СообщениеЭДО.ЭлектронныйДокумент.НомерДокумента КАК ЭлектронныйДокументНомерДокумента,
	|	СообщениеЭДО.ЭлектронныйДокумент.Дата КАК ЭлектронныйДокументДата,
	|	СообщениеЭДО.ЭлектронныйДокумент.ВидДокумента КАК ЭлектронныйДокументВидДокумента,
	|	СообщениеЭДО.ОсновнойФайл КАК ОсновнойФайл
	|ИЗ
	|	Документ.СообщениеЭДО КАК СообщениеЭДО
	|ГДЕ
	|	СообщениеЭДО.ЭлектронныйДокумент.НомерДокумента = &НомерДокумента
	|	И СообщениеЭДО.ЭлектронныйДокумент.Контрагент.ИНН = &ИНН
	|	И СообщениеЭДО.Направление = &Направление
	|	И СообщениеЭДО.ТипЭлементаРегламента = &ТипЭлементаРегламента
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭлектронныйДокументДата";
Запрос.УстановитьПараметр("НомерДокумента", СокрЛП(Объект.НомерДокВходящий));
Запрос.УстановитьПараметр("ИНН", СокрЛП(Объект.Контрагент.ИНН)); 
Запрос.УстановитьПараметр("Направление", БазаБух.Перечисления.НаправленияЭДО.Входящий);
Запрос.УстановитьПараметр("ТипЭлементаРегламента", БазаБух.Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ПутьКФайлу = "\\sd-bgd.bogo.owen\files_for_sd\"+ВыборкаДетальныеЗаписи.ОсновнойФайл.ПутьКФайлу;
	Объект.ДатаДокВходящий = ВыборкаДетальныеЗаписи.ЭлектронныйДокументДата;
	КонецЦикла;
КонецПроцедуры
            
&НаСервере
Процедура СопоставитьНоменклатуру()
БазаБух = ОбщийМодульСинхронизации.УстановитьCOMСоединение(БазаДанных);
	Если БазаБух = Неопределено Тогда
	Сообщить("Не открыто соединение с бух. базой!");
	КонецЕсли;
Запрос = БазаБух.NewObject("Запрос");
               
	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураКонтрагентов.Номенклатура.Наименование КАК НоменклатураНаименование
		|ИЗ
		|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
		|ГДЕ
		|	НоменклатураКонтрагентов.ВладелецНоменклатуры.ИНН = &ИНН
		|	И НоменклатураКонтрагентов.НаименованиеНоменклатуры = &НаименованиеНоменклатуры";
	Запрос.УстановитьПараметр("ИНН", СокрЛП(Объект.Контрагент.ИНН));
	Запрос.УстановитьПараметр("НаименованиеНоменклатуры", СокрЛП(ТЧ.НаименованиеПоставщика));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТЧ.МПЗ = Справочники.Материалы.НайтиПоНаименованию(СокрЛП(ВыборкаДетальныеЗаписи.НоменклатураНаименование),Истина);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТовары()
ЧтениеТекста = Новый ЧтениеТекста(СокрЛП(ПутьКФайлу));

Стр = ЧтениеТекста.ПрочитатьСтроку();	
	Пока Стр <> Неопределено Цикл 
		Если Найти(Стр,"НаимТов=") > 0 Тогда 
		ТЧ = Объект.ТабличнаяЧасть.Добавить();
		Товар = Сред(Стр,Найти(Стр,"НаимТов=")+9);
		Товар = Лев(Товар,Найти(Товар,"""")-1);
		Количество = Сред(Стр,Найти(Стр,"КолТов=")+8);
		Количество = Лев(Количество,Найти(Количество,"""")-1);
		Цена = Сред(Стр,Найти(Стр,"ЦенаТов=")+9);
		Цена = Лев(Цена,Найти(Цена,"""")-1);                         
		ТЧ.НаименованиеПоставщика = СтрЗаменить(Товар,"&quot;","""");
		ТЧ.Количество = Число(Количество);
		ТЧ.Остаток = ТЧ.Количество;
		ТЧ.Цена = Число(Цена);
		ИначеЕсли Найти(Стр,"НомерТД=") > 0 Тогда
		ТД = Сред(Стр,Найти(Стр,"НомерТД=")+10);
		ТД = Лев(ТД,Найти(ТД,"""")-1);
       	ТЧ.ГТД = ТД;
		ИначеЕсли Найти(Стр,"КрНаимСтрПр=") > 0 Тогда
		Страна = Сред(Стр,Найти(Стр,"КрНаимСтрПр=")+13);
		Страна = Лев(Страна,Найти(Страна,"""")-1);
       	ТЧ.Страна = Страна;
		КонецЕсли; 
    Стр = ЧтениеТекста.ПрочитатьСтроку();
	КонецЦикла;
ЧтениеТекста.Закрыть();
	Если Объект.ТабличнаяЧасть.Количество() > 0 Тогда
	Состояние("Обработка...",,"Поиск соответствия номенклатуры...");
	СопоставитьНоменклатуру();
	КонецЕсли;
КонецПроцедуры
    
&НаСервере
Процедура ПроверитьРаспределение()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеМПЗТабличнаяЧасть.Ссылка КАК Ссылка,
	|	ПоступлениеМПЗТабличнаяЧасть.МПЗ КАК МПЗ,
	|	ПоступлениеМПЗТабличнаяЧасть.Количество КАК Количество,
	|	ПоступлениеМПЗТабличнаяЧасть.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПоступлениеМПЗТабличнаяЧасть.Цена КАК Цена,
	|	ПоступлениеМПЗТабличнаяЧасть.ГТД КАК ГТД
	|ИЗ
	|	Документ.ПоступлениеМПЗ.ТабличнаяЧасть КАК ПоступлениеМПЗТабличнаяЧасть
	|ГДЕ
	|	ПоступлениеМПЗТабличнаяЧасть.Ссылка.НомерДокВходящий = &НомерДокВходящий
	|	И ПоступлениеМПЗТабличнаяЧасть.Ссылка.ДатаДокВходящий = &ДатаДокВходящий
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоступлениеМПЗТабличнаяЧасть.Ссылка.Дата";
Запрос.УстановитьПараметр("НомерДокВходящий", СокрЛП(Объект.НомерДокВходящий));
Запрос.УстановитьПараметр("ДатаДокВходящий", Объект.ДатаДокВходящий);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Выборка = Объект.ТабличнаяЧасть.НайтиСтроки(Новый Структура("МПЗ",ВыборкаДетальныеЗаписи.МПЗ));
		Если Выборка.Количество() > 0 Тогда 
		Количество = ПолучитьБазовоеКоличество(ВыборкаДетальныеЗаписи.Количество,ВыборкаДетальныеЗаписи.ЕдиницаИзмерения);
		Выборка[0].Остаток = Выборка[0].Остаток - Количество;			
		ТЧ_МПЗ = Объект.РаспределённыеМПЗ.Добавить();
		ТЧ_МПЗ.МПЗ = ВыборкаДетальныеЗаписи.МПЗ;
		ТЧ_МПЗ.Количество = Количество;
		ТЧ_МПЗ.Цена = ВыборкаДетальныеЗаписи.Цена;
		ТЧ_МПЗ.ЗаказПоставщику = ВыборкаДетальныеЗаписи.Ссылка.ДокументОснование;
		ТЧ_МПЗ.ГТД = ВыборкаДетальныеЗаписи.ГТД;
		ТЧ_МПЗ.ПоступлениеМПЗ = ВыборкаДетальныеЗаписи.Ссылка;		
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзБухБазы(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	ПутьКФайлу = "";
	Состояние("Обработка...",,"Получение файла XML...");
	ПолучитьДокументЭДОНаСервере();
		Если ЗначениеЗаполнено(ПутьКФайлу) Тогда
		Состояние("Обработка...",,"Чтение файла XML...");
		ПолучитьТовары();
		ПроверитьРаспределение();
		Иначе
		Сообщить("Не найден документ в бухгалтерской базе!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
